Revit 2027 API
ParameterTypeId.StructuralAttachmentEndValueDistance Property
 "End Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentEndValueDistance { get; }
Public Shared ReadOnly Property StructuralAttachmentEndValueDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentEndValueDistance {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentEndValueDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace